


&НаСервереБезКонтекста
Процедура СтатусПриИзмененииНаСервере(СтруктураЗаявкаНаПеревозку)
	Если СтруктураЗаявкаНаПеревозку.МаршрутныйЛист <> Документы.МаршрутныйЛист.ПустаяСсылка() Тогда
		Для Каждого СтрокаТаблицы из СтруктураЗаявкаНаПеревозку.МаршрутныйЛист.Маршрут Цикл
			Если СтрокаТаблицы.ЗаявкаНаПеревозку =  СтруктураЗаявкаНаПеревозку.ЗаявкаНаПеревозку Тогда
//			Документ = СтруктураЗаявкаНаПеревозку.МаршрутныйЛист.ПолучитьОбъект();
//			Документ.Маршрут.Статус = СтруктураЗаявкаНаПеревозку.Статус;
//			Документ.Записать();
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтруктураЗаявкаНаПеревозку = Новый Структура();
	СтруктураЗаявкаНаПеревозку.Вставить("МаршрутныйЛист", Объект.МаршрутныйЛист);
	СтруктураЗаявкаНаПеревозку.Вставить("Статус", Объект.Статус);
	СтруктураЗаявкаНаПеревозку.Вставить("ЗаявкаНаПеревозку", Объект.Ссылка);
	СтатусПриИзмененииНаСервере(СтруктураЗаявкаНаПеревозку);
КонецПроцедуры