Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Прибыль
	Движения.Прибыль.Записывать = Истина;
	Для Каждого ТекСтрокаМаршрут из Маршрут Цикл
		Движение = Движения.Прибыль.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Заявка = ЗаявкаКлиента;
		Движение.Сумма = ТекСтрокаМаршрут.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОбщаяСтоимость =  Маршрут.Итог("Сумма")
КонецПроцедуры
