&НаСервере 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Объект.ДатаПогрузки = Параметры.ДатаПогрузки;
	Объект.ДатаРазгрузки = Параметры.ДатаРазгрузки;
	Объект.ТочкаРазгрузки = Параметры.НачальнаяТочка;
	Объект.ТочкаПогрузки = Параметры.КонечнаяТочка;
КонецПроцедуры



&НаКлиенте
Процедура МояКнопка(Команда)
	
	//Перевозчик, Стоимость, Статус,Ид
	СтруктураЗаявкаНаПеревозку = Новый Структура("");
	СтруктураЗаявкаНаПеревозку.Вставить("Перевозчик", Объект.Перевозчик);
	СтруктураЗаявкаНаПеревозку.Вставить("Сумма", Объект.Сумма);
	СтруктураЗаявкаНаПеревозку.Вставить("Статус", Объект.Статус);
	СтруктураЗаявкаНаПеревозку.Вставить("ЗаявкаНаПеревозку", Объект.Ссылка);
	Закрыть(СтруктураЗаявкаНаПеревозку);
КонецПроцедуры